src/toir_cfe/src/InformationRegisters/торо_АналогиНоменклатурыДляРемонтов/торо_АналогиНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bd75473a-e6a0-45ee-a83a-941e99a8d526">
  <name>торо_АналогиНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="810e87f2-60ec-4c6f-a698-b46ac061bf7a">
    <name>ПериодЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b7da3a7a-7f93-4d82-b739-a7fce6b51bb5">
    <name>УпаковкаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a912cf23-ea02-49c6-9436-c42a62dc455e">
    <name>КоличествоМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62b487cf-3318-420c-850b-a279c9ea8cdc">
    <name>КоличествоУпаковокМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce89a4f9-62f1-4509-a089-dce3ae891031">
    <name>УпаковкаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5153709f-d763-4f1c-b0b0-4662a1f640f4">
    <name>КоличествоАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8cec5131-0504-466d-ac20-43194aba1d2c">
    <name>КоличествоУпаковокАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="59851635-0a58-4b1c-8731-113c1e7c611e">
    <name>Материал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0abaad15-010c-4720-b462-1a1169662393">
    <name>ХарактеристикаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3e0ba762-2301-4507-bb58-f8a616708252">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3abcbaea-a6e9-479b-956d-13dc9e932eb0">
    <name>КлючСвязиСпецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1ea4a6a3-d4bb-4680-a389-ddbe5b71d9c8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="21559ab3-21fe-4274-93d2-bead9faf4226">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="554b3f39-42e7-4c9c-93d9-4d44f5dc9c0d">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ad8d66e2-91c2-4772-a887-4764fd6f2379">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="80a5eaa4-3b19-491a-84a3-998bc6f03267">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="49bd9538-5775-49d3-a7d5-ee278e515679">
    <name>Аналог</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="df826c69-f7c0-41bd-a065-365bf48abb7e">
    <name>ХарактеристикаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/AccumulationRegisters/проф_ТоварыНаСкладах/проф_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2b5e01-847b-49d9-b668-ee6122445039">
  <name>проф_ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="78a7323c-7389-4599-84d6-fde6c3c3533d">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="9c39d63c-41cb-4486-a9ee-180052b85921">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8289f7d9-fa0a-45f7-be0c-238495f87a84">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8df19511-0c7e-41a8-90eb-f953e351a534">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bd312888-71b8-45b3-bbf7-970c05bc2727">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="951359e6-820e-4f61-a602-16a239f40091">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="328ce0e5-8d0f-4315-8e53-033acc81fdd0">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="24711251-eb0c-4d8e-9fc2-dec1853a6bc5">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="705e506d-db5a-4184-9ca1-dec5c3ff5d62">
    <name>НеИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15c1cae0-77b2-42e1-a9de-a4c4f175befc">
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f51a8342-ea7d-40c4-ab28-217a0342be10">
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/торо_УстановкаАналоговНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="70713d91-cbcb-4e92-ac9f-a0a817d6e0ce">
  <name>торо_УстановкаАналоговНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3941362c-26be-4fff-a565-63e2a4c4214a">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="34ec1fe8-0682-46e1-9881-f904b5468771">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="424f5519-312d-42a6-ac10-615c02711cf2">
    <name>УказаниеПоПрименению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26bac8ba-27be-488f-ba8f-9b81a02af2d2">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59bb11af-2006-4299-a16c-2a763773be5f">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6983a326-a9e9-4d7b-b740-6b3f76280b8c">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d2c92ace-8e7a-43f2-a392-285cbac3ad37">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f1ae0b5-4b90-4756-96fa-c5647a70a735">
    <name>СписокОбъектовРМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e8926b2-9f0c-491e-9210-4dda111cb257">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="afd8c838-4157-4908-a6bc-13e15246f203">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b968bd78-d9f7-4136-b7f5-27eb5b522e66">
    <name>проф_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="909b34e1-9074-4194-945d-47599019dd04">
    <name>Аналоги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="516454eb-a002-4aa7-8e2d-4ae0f2cb11f7">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2d2125b4-e902-4499-8955-1cfbf0b37e03">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e5560730-2fd7-492d-80f3-ed2e8044197f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b1c2cab1-49ce-4f27-9ed4-59c15c3d370e">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="884799a4-d659-4fea-917e-798420697301">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2201f132-10ef-4ff7-9f15-83c61b78d683">
    <name>Материалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6ac84c55-480e-4ee8-b529-9b2a86b5b25b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84ac5858-07f7-4abb-a4c5-b59bbdff0e63">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b48b0cdc-05dd-409f-b3a0-8085af8ffa5f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57210a28-5600-40dd-ad64-ebc75b73765a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e502bc90-b43e-4dc6-ac08-9de107ff5d82">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a180ce65-2990-4b3d-80fc-83f6ef430224">
      <name>КлючСвязиТехКарта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/проф_НастройкиСистемы/проф_НастройкиСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6e97bacd-581f-457e-8194-0e56df384c90">
  <name>проф_НастройкиСистемы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="eabacba6-c7c4-412a-966b-4fb545be0373">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c4e4dd9-9400-4bf0-9b2e-c1573d654f58">
    <name>СодержитСписок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f7730688-f0b4-4a4e-bd02-3164755a6070">
    <name>Список</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ab1fcde9-7b4c-4938-b9c2-6ef7d23645d2">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad62bbb-21aa-4934-a430-a1bd6aa95383">
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/CommonForms/торо_ФормаВыбораАналогаНоменклатурыДляРемонта/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура проф_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #351, Соловьев А.А., 17.11.2023
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("Аналог", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("ХарактеристикаАналога", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	//-- Проф-ИТ, #351, Соловьев А.А., 17.11.2023
	
	//++ Проф-ИТ, #174, Соловьев А.А., 27.10.2023
	ЗаменитьЗапросыДинамическихСписков(Параметры);
	
	УстановитьУсловноеОформление();
	
	Номенклатура 				= Параметры.Номенклатура;
	Упаковка					= Параметры.ЕдиницаИзмерения;
	КоличествоУпаковок			= Параметры.Количество;
	Количество					= Параметры.КоличествоЕдиниц;
	ИсходноеКоличество			= КоличествоУпаковок;
	ИсходнаяУпаковка			= Упаковка;
	ИсходнаяЕдиницаИзмерения	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
	ИсходноеКоличествоЕд		= Количество;
	СтраховойЗапас 				= (Параметры.Свойство("СтраховойЗапас"));
	
	НаборУпаковок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
	
	Элементы.Упаковка.Видимость			= ЗначениеЗаполнено(НаборУпаковок);
	Элементы.ЕдиницаИзмерения.Видимость = Не ЗначениеЗаполнено(НаборУпаковок);
	
	ПараметрыВыбораУпаковки = Новый Структура("Номенклатура", Номенклатура);
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.УпаковкиНоменклатуры"), ПараметрыВыбораУпаковки);
	
	СписокВыбора = Элементы.Упаковка.СписокВыбора;
	
	Для Каждого ЗначениеВыбора из ДанныеВыбора Цикл
		СписокВыбора.Добавить(ЗначениеВыбора.Значение, ЗначениеВыбора.Представление);
	КонецЦикла;
	
	Элементы.МатериалыХарактеристика.Видимость = ПолучитьФункциональнуюОпцию(
													"торо_ИспользоватьХарактеристикиНоменклатуры");
	
	ОткрытиеФормы = Истина;
	//-- Проф-ИТ, #174, Соловьев А.А., 27.10.2023
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #174, Соловьев А.А., 27.10.2023

&НаСервере
Процедура ЗаменитьЗапросыДинамическихСписков(Параметры)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ID							= Параметры.ID;
	ID_Ремонт					= Параметры.РемонтыОборудования_ID;
	Номенклатура				= Параметры.Номенклатура;
	Характеристика				= Параметры.ХарактеристикаНоменклатуры;
	ОбъектРемонта				= Параметры.ОбъектРемонта;
	Подразделение				= Параметры.ПодразделениеИсполнитель;
	ВидРемонта					= Параметры.ВидРемонта;
	ТехКарта					= Параметры.ТехКарта;
	СтраховойЗапас 				= (Параметры.Свойство("СтраховойЗапас"));
	Количество					= Параметры.КоличествоЕдиниц;
	
	Если СтраховойЗапас Тогда 
		Склад					= Параметры.Склад;
	Иначе
		Склад					= Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	Если СтраховойЗапас И Не ЗначениеЗаполнено(Склад) Тогда 
		ТекстСообщения = НСтр("ru = 'Не выбран склад для отображения остатков'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ШаблонЗаголовка = Нстр("ru = 'Аналоги материала ""%1"" (%2 %3)'");
	Заголовок = СтрШаблон(ШаблонЗаголовка, СокрЛП(Номенклатура), КоличествоУпаковок,
		?(ЗначениеЗаполнено(Упаковка), СокрЛП(Упаковка), ИсходнаяЕдиницаИзмерения));
	
	ПустаяСсылкаАналоги = Документы.торо_УстановкаАналоговНоменклатурыДляРемонтов.ПустаяСсылка();
	ДатаРемонта = ?(Параметры.ДатаРемонта = Неопределено, ТекущаяДата, Параметры.ДатаРемонта);;
	
	Если ТипЗнч(ОбъектРемонта) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		РеквизитыОР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектРемонта, "Организация, Направление");
		ОрганизацияОР = РеквизитыОР.Организация;
		НаправлениеОР = РеквизитыОР.Направление;
	Иначе
		ОрганизацияОР = Справочники.Организации.ПустаяСсылка();
		НаправлениеОР = Справочники.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка();
	КонецЕсли;
	
	СтрПодразделенияСлужбыТОИР = "ПодразделенияСлужбыТОИР";
	ПодразделенияСлужбыТОИР = Справочники.проф_НастройкиСистемы.ПолучитьСпЗначНастройкиСистемы(
		"Подразделения", СтрПодразделенияСлужбыТОИР);
	
	СтруктураСвойствСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СтруктураСвойствСписка.ТекстЗапроса = ТекстЗапросаСписок();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СтруктураСвойствСписка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Дата",						Дата(1, 1, 1));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаРемонта",				ДатаРемонта);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Материал",					Номенклатура);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ХарактеристикаМатериала",	Характеристика);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "КоличествоПоЗаказу",		Количество);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОбъектРемонта", 			ОбъектРемонта);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаправлениеОбъектаРемонта", НаправлениеОР);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", 				ОрганизацияОР);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ПодразделениеИсполнитель",	Подразделение);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТехКарта", 					ТехКарта);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидРемонта", 				ВидРемонта);
	
	СтруктураСвойствСписка.ТекстЗапроса = ТекстЗапросаМатериалы();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Материалы, СтруктураСвойствСписка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы,
																СтрПодразделенияСлужбыТОИР, ПодразделенияСлужбыТОИР);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Номенклатура",	Номенклатура);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Характеристика", Характеристика);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "ТекущаяДата",	ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Склад",			Склад);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Дата",			ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Ссылка",			ПустаяСсылкаАналоги);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Кратность",		1);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "СтраховойЗапас", СтраховойЗапас);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Материал", 		Номенклатура);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "ХарактеристикаМатериала", Характеристика);
	
	СтруктураСвойствСписка.ТекстЗапроса = ТекстЗапросаАналоги();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Аналоги, СтруктураСвойствСписка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги,
															 СтрПодразделенияСлужбыТОИР, ПодразделенияСлужбыТОИР);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Номенклатура",		Номенклатура);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Характеристика",	Характеристика);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "ТекущаяДата",		ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Склад",			Склад);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Дата",				ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Ссылка",			ПустаяСсылкаАналоги);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Кратность",		1);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "СтраховойЗапас",	СтраховойЗапас);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Аналог", 			ЭтотОбъект["Аналог"]);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "ХарактеристикаАналога", ЭтотОбъект["ХарактеристикаАналога"]);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаМатериалы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	торо_АналогиНоменклатурыДляРемонтов.Регистратор КАК Ссылка,
	|	торо_АналогиНоменклатурыДляРемонтов.Материал КАК Номенклатура,
	|	торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаМатериала КАК Характеристика,
	|	торо_АналогиНоменклатурыДляРемонтов.КоличествоМатериала КАК Количество,
	|	торо_АналогиНоменклатурыДляРемонтов.УпаковкаМатериала КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ УпаковкиНоменклатуры.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	СправочникНоменклатура.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)) КАК ХарактеристикиИспользуются
	|ПОМЕСТИТЬ втУстановкаАналоговМатериалы
	|ИЗ
	|	РегистрСведений.торо_АналогиНоменклатурыДляРемонтов КАК торо_АналогиНоменклатурыДляРемонтов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО торо_АналогиНоменклатурыДляРемонтов.УпаковкаМатериала = УпаковкиНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО торо_АналогиНоменклатурыДляРемонтов.Материал = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	торо_АналогиНоменклатурыДляРемонтов.Регистратор = &Ссылка
	|	И торо_АналогиНоменклатурыДляРемонтов.Материал = &Материал
	|	И торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаМатериала = &ХарактеристикаМатериала
	|	И торо_АналогиНоменклатурыДляРемонтов.Аналог = &Аналог
	|	И торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаАналога = &ХарактеристикаАналога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличии
	|ПОМЕСТИТЬ втТоварыНаСкладахПредв
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			&СтраховойЗапас
	|			И Склад В (&Склад)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						втУстановкаАналоговМатериалы.Номенклатура КАК Номенклатура,
	|						втУстановкаАналоговМатериалы.Характеристика КАК Характеристика
	|					ИЗ
	|						втУстановкаАналоговМатериалы КАК втУстановкаАналоговМатериалы)
	|				И Назначение = ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка)) КАК ТоварыНаСкладахОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	проф_ТоварыНаСкладахОстатки.Номенклатура,
	|	проф_ТоварыНаСкладахОстатки.Характеристика,
	|	проф_ТоварыНаСкладахОстатки.ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			&СтраховойЗапас
	|			И Склад В (&Склад)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						втУстановкаАналоговМатериалы.Номенклатура КАК Номенклатура,
	|						втУстановкаАналоговМатериалы.Характеристика КАК Характеристика
	|					ИЗ
	|						втУстановкаАналоговМатериалы КАК втУстановкаАналоговМатериалы)) КАК проф_ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|		ПО проф_ТоварыНаСкладахОстатки.Назначение = проф_Назначения.Ссылка
	|			И (проф_Назначения.Подразделение В (&ПодразделенияСлужбыТОИР))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	проф_ТоварыНаСкладахОстатки.Номенклатура,
	|	проф_ТоварыНаСкладахОстатки.Характеристика,
	|	проф_ТоварыНаСкладахОстатки.ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			НЕ &СтраховойЗапас
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						втУстановкаАналоговМатериалы.Номенклатура КАК Номенклатура,
	|						втУстановкаАналоговМатериалы.Характеристика КАК Характеристика
	|					ИЗ
	|						втУстановкаАналоговМатериалы КАК втУстановкаАналоговМатериалы)) КАК проф_ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварыНаСкладахПредв.Номенклатура КАК Номенклатура,
	|	втТоварыНаСкладахПредв.Характеристика КАК Характеристика,
	|	СУММА(втТоварыНаСкладахПредв.ВНаличии) КАК ВНаличии
	|ПОМЕСТИТЬ ВсеОстатки
	|ИЗ
	|	втТоварыНаСкладахПредв КАК втТоварыНаСкладахПредв
	|
	|СГРУППИРОВАТЬ ПО
	|	втТоварыНаСкладахПредв.Номенклатура,
	|	втТоварыНаСкладахПредв.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУстановкаАналоговМатериалы.Ссылка КАК Ссылка,
	|	втУстановкаАналоговМатериалы.Номенклатура КАК Номенклатура,
	|	втУстановкаАналоговМатериалы.Характеристика КАК Характеристика,
	|	втУстановкаАналоговМатериалы.Количество * &Кратность КАК Количество,
	|	ВЫРАЗИТЬ(втУстановкаАналоговМатериалы.Количество * &Кратность / втУстановкаАналоговМатериалы.Коэффициент КАК ЧИСЛО(15, 3)) КАК КоличествоУпаковок,
	|	втУстановкаАналоговМатериалы.Упаковка КАК Упаковка,
	|	втУстановкаАналоговМатериалы.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВсеОстатки.ВНаличии, 0) / втУстановкаАналоговМатериалы.Коэффициент КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток
	|ИЗ
	|	втУстановкаАналоговМатериалы КАК втУстановкаАналоговМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОстатки КАК ВсеОстатки
	|		ПО втУстановкаАналоговМатериалы.Номенклатура = ВсеОстатки.Номенклатура
	|			И втУстановкаАналоговМатериалы.Характеристика = ВсеОстатки.Характеристика";
		
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаАналоги()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	торо_АналогиНоменклатурыДляРемонтов.Регистратор КАК Ссылка,
	|	торо_АналогиНоменклатурыДляРемонтов.Аналог КАК Номенклатура,
	|	торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаАналога КАК Характеристика,
	|	торо_АналогиНоменклатурыДляРемонтов.КоличествоАналога КАК Количество,
	|	торо_АналогиНоменклатурыДляРемонтов.УпаковкаАналога КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ УпаковкиНоменклатуры.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	СправочникНоменклатура.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)) КАК ХарактеристикиИспользуются
	|ПОМЕСТИТЬ втУстановкаАналоговАналоги
	|ИЗ
	|	РегистрСведений.торо_АналогиНоменклатурыДляРемонтов КАК торо_АналогиНоменклатурыДляРемонтов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО торо_АналогиНоменклатурыДляРемонтов.УпаковкаАналога = УпаковкиНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО торо_АналогиНоменклатурыДляРемонтов.Аналог = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	торо_АналогиНоменклатурыДляРемонтов.Регистратор = &Ссылка
	|	И торо_АналогиНоменклатурыДляРемонтов.Аналог = &Аналог
	|	И торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаАналога = &ХарактеристикаАналога
	|	И торо_АналогиНоменклатурыДляРемонтов.Материал = &Материал
	|	И торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаМатериала = &ХарактеристикаМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличии
	|ПОМЕСТИТЬ втТоварыНаСкладахПредв
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			&СтраховойЗапас
	|				И Склад В (&Склад)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						втУстановкаАналоговАналоги.Номенклатура КАК Номенклатура,
	|						втУстановкаАналоговАналоги.Характеристика КАК Характеристика
	|					ИЗ
	|						втУстановкаАналоговАналоги КАК втУстановкаАналоговАналоги)
	|				И Назначение = ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка)) КАК ТоварыНаСкладахОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	проф_ТоварыНаСкладахОстатки.Номенклатура,
	|	проф_ТоварыНаСкладахОстатки.Характеристика,
	|	проф_ТоварыНаСкладахОстатки.ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			&СтраховойЗапас
	|				И Склад В (&Склад)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						втУстановкаАналоговАналоги.Номенклатура КАК Номенклатура,
	|						втУстановкаАналоговАналоги.Характеристика КАК Характеристика
	|					ИЗ
	|						втУстановкаАналоговАналоги КАК втУстановкаАналоговАналоги)) КАК проф_ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|		ПО проф_ТоварыНаСкладахОстатки.Назначение = проф_Назначения.Ссылка
	|			И (проф_Назначения.Подразделение В (&ПодразделенияСлужбыТОИР))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	проф_ТоварыНаСкладахОстатки.Номенклатура,
	|	проф_ТоварыНаСкладахОстатки.Характеристика,
	|	проф_ТоварыНаСкладахОстатки.ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			НЕ &СтраховойЗапас
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						втУстановкаАналоговАналоги.Номенклатура КАК Номенклатура,
	|						втУстановкаАналоговАналоги.Характеристика КАК Характеристика
	|					ИЗ
	|						втУстановкаАналоговАналоги КАК втУстановкаАналоговАналоги)) КАК проф_ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварыНаСкладахПредв.Номенклатура КАК Номенклатура,
	|	втТоварыНаСкладахПредв.Характеристика КАК Характеристика,
	|	СУММА(втТоварыНаСкладахПредв.ВНаличии) КАК ВНаличии
	|ПОМЕСТИТЬ ВсеОстатки
	|ИЗ
	|	втТоварыНаСкладахПредв КАК втТоварыНаСкладахПредв
	|
	|СГРУППИРОВАТЬ ПО
	|	втТоварыНаСкладахПредв.Номенклатура,
	|	втТоварыНаСкладахПредв.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУстановкаАналоговАналоги.Ссылка КАК Ссылка,
	|	втУстановкаАналоговАналоги.Номенклатура КАК Номенклатура,
	|	втУстановкаАналоговАналоги.Характеристика КАК Характеристика,
	|	втУстановкаАналоговАналоги.Количество * &Кратность КАК Количество,
	|	ВЫРАЗИТЬ(втУстановкаАналоговАналоги.Количество * &Кратность / втУстановкаАналоговАналоги.Коэффициент КАК ЧИСЛО(15, 3)) КАК КоличествоУпаковок,
	|	втУстановкаАналоговАналоги.Упаковка КАК Упаковка,
	|	втУстановкаАналоговАналоги.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВсеОстатки.ВНаличии, 0) / втУстановкаАналоговАналоги.Коэффициент КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток
	|ИЗ
	|	втУстановкаАналоговАналоги КАК втУстановкаАналоговАналоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОстатки КАК ВсеОстатки
	|		ПО втУстановкаАналоговАналоги.Номенклатура = ВсеОстатки.Номенклатура
	|			И втУстановкаАналоговАналоги.Характеристика = ВсеОстатки.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//-- Проф-ИТ, #174, Соловьев А.А., 27.10.2023

//++ Проф-ИТ, #351, Соловьев А.А., 15.11.2023

&НаСервере
Функция ТекстЗапросаСписок()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Ссылка КАК Ссылка,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ВерсияДанных КАК ВерсияДанных,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ПометкаУдаления КАК ПометкаУдаления,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Номер КАК Номер,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(&ОбъектРемонта) = ТИП(Справочник.торо_СписокОбъектовРегламентногоМероприятия)
	|			ТОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ
	|		ИНАЧЕ торо_УстановкаАналоговНоменклатурыДляРемонтов.ОбъектРемонта
	|	КОНЕЦ КАК ОбъектРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Проведен КАК Проведен,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ВидРемонта КАК ВидРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ТехКарта КАК ТехКарта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта КАК НаправлениеОбъектаРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Организация КАК Организация,
	|	ВЫРАЗИТЬ(торо_УстановкаАналоговНоменклатурыДляРемонтов.УказаниеПоПрименению КАК СТРОКА(100)) КАК УказаниеПоПрименению,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Ответственный КАК Ответственный,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Подразделение КАК Подразделение,
	|	ИСТИНА КАК ПростаяЗамена,
	|	АналогиВПроизводстве.Регистратор КАК Регистратор,
	|	АналогиВПроизводстве.НомерСтроки КАК НомерСтроки,
	|	АналогиВПроизводстве.Аналог КАК Аналог,
	|	АналогиВПроизводстве.ХарактеристикаАналога КАК ХарактеристикаАналога,
	|	АналогиВПроизводстве.УпаковкаАналога КАК УпаковкаАналога,
	|	АналогиВПроизводстве.КоличествоАналога * (ВЫРАЗИТЬ(&КоличествоПоЗаказу / АналогиВПроизводстве.КоличествоМатериала - 0.5 КАК ЧИСЛО(15, 0))) КАК КоличествоАналога,
	|	АналогиВПроизводстве.КоличествоУпаковокАналога * (ВЫРАЗИТЬ(&КоличествоПоЗаказу / АналогиВПроизводстве.КоличествоМатериала - 0.5 КАК ЧИСЛО(15, 0))) КАК КоличествоУпаковокАналога,
	|	АналогиВПроизводстве.КоличествоМатериала КАК КоличествоМатериалаПоДокументу,
	|	ВЫБОР
	|		КОГДА &КоличествоПоЗаказу = АналогиВПроизводстве.КоличествоМатериала * (ВЫРАЗИТЬ(&КоличествоПоЗаказу / АналогиВПроизводстве.КоличествоМатериала - 0.5 КАК ЧИСЛО(15, 0)))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК КоличестваНеДостаточноДляЗамены,
	|	АналогиВПроизводстве.УпаковкаМатериала КАК УпаковкаМатериала,
	|	АналогиВПроизводстве.КоличествоУпаковокМатериала КАК КоличествоУпаковокМатериала,
	|	АналогиВПроизводстве.Материал.ЕдиницаИзмерения КАК МатериалЕдиницаИзмерения,
	|	АналогиВПроизводстве.Аналог.ЕдиницаИзмерения КАК АналогЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.торо_АналогиНоменклатурыДляРемонтов КАК АналогиВПроизводстве
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов КАК торо_УстановкаАналоговНоменклатурыДляРемонтов
	|		ПО АналогиВПроизводстве.Регистратор = торо_УстановкаАналоговНоменклатурыДляРемонтов.Ссылка
	|ГДЕ
	|	АналогиВПроизводстве.Материал = &Материал
	|	И АналогиВПроизводстве.ХарактеристикаМатериала = &ХарактеристикаМатериала
	|	И АналогиВПроизводстве.Период <= &ДатаРемонта
	|	И ВЫБОР
	|			КОГДА АналогиВПроизводстве.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &ДатаРемонта <= АналогиВПроизводстве.ПериодЗавершения
	|		КОНЕЦ
	|	И АналогиВПроизводстве.ОбъектРемонта В (&ОбъектРемонта, ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка))
	|	И АналогиВПроизводстве.НаправлениеОбъектаРемонта В (&НаправлениеОбъектаРемонта, ЗНАЧЕНИЕ(Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка))
	|	И АналогиВПроизводстве.Организация В (&Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И АналогиВПроизводстве.Подразделение В (&ПодразделениеИсполнитель, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	И АналогиВПроизводстве.ТехКарта В (&ТехКарта, ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка))
	|	И АналогиВПроизводстве.ВидРемонта В (&ВидРемонта, ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
&Вместо("ОбработчикАктивизацииСтрокиСписок")
Процедура проф_ОбработчикАктивизацииСтрокиСписок()
		
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кратность = КратностьЗамены(Количество, ТекущиеДанные.КоличествоМатериалаПоДокументу);
	
	Если ТекСсылка <> ТекущиеДанные.Ссылка или ТекКратность <> Кратность Тогда
		
		ТекСсылка = ТекущиеДанные.Ссылка;
		ТекКратность = Кратность;
		Аналог = ТекущиеДанные.Аналог;
		ХарактеристикаАналога = ТекущиеДанные.ХарактеристикаАналога;
		
		УстановитьПараметрыДинамическихСписковНаСервере();
		
		ОбновитьПредставлениеОбластиДействия(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&После("УстановитьПараметрыДинамическихСписковНаСервере")
Процедура проф_УстановитьПараметрыДинамическихСписковНаСервере(КоличествоПоЗаказу)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Материал", Номенклатура);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "ХарактеристикаМатериала", Характеристика);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "Аналог", ЭтотОбъект["Аналог"]);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Материалы, "ХарактеристикаАналога", ЭтотОбъект["ХарактеристикаАналога"]);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Аналог", ЭтотОбъект["Аналог"]);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "ХарактеристикаАналога", ЭтотОбъект["ХарактеристикаАналога"]);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "Материал", Номенклатура);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аналоги, "ХарактеристикаМатериала", Характеристика);
	
КонецПроцедуры

&НаСервере
&Вместо("ЗначениеВыбораНаСервере")
Функция проф_ЗначениеВыбораНаСервере(Ссылка, КоличествоПоДокументу, Идентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ID КАК ID,
	|	&РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_АналогиНоменклатурыДляРемонтов.Материал КАК Материал,
	|	торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаМатериала КАК ХарактеристикаМатериала,
	|	торо_АналогиНоменклатурыДляРемонтов.Аналог КАК Аналог,
	|	торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаАналога КАК ХарактеристикаАналога,
	|	торо_АналогиНоменклатурыДляРемонтов.УпаковкаМатериала КАК УпаковкаМатериала,
	|	торо_АналогиНоменклатурыДляРемонтов.КоличествоМатериала КАК КоличествоМатериала,
	|	торо_АналогиНоменклатурыДляРемонтов.УпаковкаАналога КАК УпаковкаАналога,
	|	торо_АналогиНоменклатурыДляРемонтов.КоличествоАналога КАК КоличествоАналога
	|ПОМЕСТИТЬ втДанныеРегистраАналоги
	|ИЗ
	|	РегистрСведений.торо_АналогиНоменклатурыДляРемонтов КАК торо_АналогиНоменклатурыДляРемонтов
	|ГДЕ
	|	торо_АналогиНоменклатурыДляРемонтов.Регистратор = &Ссылка
	|	И торо_АналогиНоменклатурыДляРемонтов.Материал = &Материал
	|	И торо_АналогиНоменклатурыДляРемонтов.Аналог = &Аналог
	|	И торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаМатериала = &ХарактеристикаМатериала
	|	И торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаАналога = &ХарактеристикаАналога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.ID КАК ID,
	|	Материалы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Материалы.Материал КАК Номенклатура,
	|	Материалы.ХарактеристикаМатериала КАК ХарактеристикаНоменклатуры,
	|	Материалы.КоличествоМатериала * &Кратность КАК Количество,
	|	ВЫРАЗИТЬ(Материалы.КоличествоМатериала * &Кратность / ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1) КАК ЧИСЛО(15, 3)) КАК КоличествоУпаковок,
	|	Материалы.УпаковкаМатериала КАК Упаковка
	|ИЗ
	|	втДанныеРегистраАналоги КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО Материалы.УпаковкаМатериала = УпаковкиНоменклатуры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Аналоги.ID КАК ID,
	|	Аналоги.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Аналоги.Аналог КАК Номенклатура,
	|	Аналоги.ХарактеристикаАналога КАК ХарактеристикаНоменклатуры,
	|	Аналоги.КоличествоАналога * &Кратность КАК КоличествоЕдиниц,
	|	ВЫРАЗИТЬ(Аналоги.КоличествоАналога * &Кратность / ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1) КАК ЧИСЛО(15, 3)) КАК Количество,
	|	Аналоги.УпаковкаАналога КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)) КАК ХарактеристикиИспользуются
	|ИЗ
	|	втДанныеРегистраАналоги КАК Аналоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Аналоги.Аналог = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО Аналоги.УпаковкаАналога = УпаковкиНоменклатуры.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Материал", ЭтотОбъект["Номенклатура"]);
	Запрос.УстановитьПараметр("ХарактеристикаМатериала", ЭтотОбъект["Характеристика"]);
	Запрос.УстановитьПараметр("Аналог", ЭтотОбъект["Аналог"]);
	Запрос.УстановитьПараметр("ХарактеристикаАналога", ЭтотОбъект["ХарактеристикаАналога"]);
	Запрос.УстановитьПараметр("Кратность", КратностьЗамены(Количество, КоличествоПоДокументу));
	Запрос.УстановитьПараметр("ID", ЭтотОбъект["ID"]);
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", ЭтотОбъект["ID_Ремонт"]);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ЗначениеВыбора = Новый Структура("Материалы, Аналоги");
	
	ЗначениеВыбора.Материалы = Результат[1].Выгрузить();
	ЗначениеВыбора.Аналоги = Результат[2].Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ЗначениеВыбора, Идентификатор);
	
КонецФункции

//-- Проф-ИТ, #351, Соловьев А.А., 15.11.2023

#КонецОбласти
